black-box-iot/proMega/variants/100-pin-avr/pins_arduino.h
/***************************************************|
|            MEGACORE 100-PIN AVR PINOUT            |
|        https://github.com/MCUdude/MegaCore        |
|                                                   |
| This file is used when compiling for:             |
| ATmega2560/V                                      |
| ATmega1280/V                                      |
| ATmega640/V                                       |
|                                                   |
|***************************************************/


#ifndef Pins_Arduino_h
#define Pins_Arduino_h

#include <avr/pgmspace.h>

#define MEGACORE
#define MCUDUDE_MEGACORE

// Current pinout
#define MEGACORE_100_PIN_AVR_PINOUT

// ATmega640, ATmega1280, ATmega2560
#if defined(__AVR_ATmega640__) || defined(__AVR_ATmega1280__) || defined(__AVR_ATmega2560__)
  // Digital pins
  #define NUM_DIGITAL_PINS            (86)

  // PWM pins
  #define digitalPinHasPWM(p)         (((p) >= 3 && (p) <= 5) || \
                                      ((p) >= 11 && (p)<= 14) || \
                                      ((p) >= 19 && (p)<= 22) || \
                                      ((p) >= 29 && (p)<= 31) || \
                                      ((p) == 85))
  // Builtin LED
  #define LED_BUILTIN                 (22)
  static const uint8_t LED = LED_BUILTIN;

  // SPI defs
  #define PIN_SPI_SS                  (15)
  #define PIN_SPI_SCK                 (16)
  #define PIN_SPI_MOSI                (17)
  #define PIN_SPI_MISO                (18)
  static const uint8_t SS   = PIN_SPI_SS;
  static const uint8_t SCK  = PIN_SPI_SCK;
  static const uint8_t MOSI = PIN_SPI_MOSI;
  static const uint8_t MISO = PIN_SPI_MISO;

  // i2c defs
  #define PIN_WIRE_SDA                (35)
  #define PIN_WIRE_SCL                (34)
  static const uint8_t SDA = PIN_WIRE_SDA;
  static const uint8_t SCL = PIN_WIRE_SCL;

  // Serial defs
  #define SERIAL_PORT_MONITOR         Serial
  #define SERIAL_PORT_HARDWARE        Serial
  #define SERIAL_PORT_HARDWARE1       Serial1
  #define SERIAL_PORT_HARDWARE2       Serial2
  #define SERIAL_PORT_HARDWARE3       Serial3
  #define SERIAL_PORT_HARDWARE_OPEN   Serial1
  #define SERIAL_PORT_HARDWARE_OPEN1  Serial2
  #define SERIAL_PORT_HARDWARE_OPEN2  Serial3

  // Interrupts
  #define EXTERNAL_NUM_INTERRUPTS     (8)
  #define digitalPinToInterrupt(p)    ((((p) >= 4) && ((p) <= 7))  ? (p) : \
                                      (((p) >= 34) && ((p) <= 37)) ? ((p) - 34) : NOT_AN_INTERRUPT)

  // PCINT defs
  #define digitalPinToPCICR(p)        (((p) == 0)  || \
                                      (((p) >= 15) && ((p) <= 22)) || \
                                      (((p) >= 52) && ((p) <= 58)) || \
                                      (((p) >= 77) && ((p) <= 84)) ?  (&PCICR) : ((uint8_t *)0))

  #define digitalPinToPCICRbit(p)     ((((p) >= 15) && ((p) <= 22)) ? 0 : \
                                      ((((p) >= 52) && ((p) <= 58)) || ((p) == 0)) ? 1 : \
                                      (((p) >= 77)  && ((p) <= 84)) ? 2 : 0)

  #define digitalPinToPCMSK(p)        ((((p) >= 15) && ((p) <= 22)) ? (&PCMSK0) : \
                                      ((((p) >= 52) && ((p) <= 58)) || ((p) == 0)) ? (&PCMSK1) : \
                                      (((p) >= 77)  && ((p) <= 84)) ? (&PCMSK2) : ((uint8_t *)0))

  #define digitalPinToPCMSKbit(p)     ((((p) >= 15) && ((p) <= 22)) ? ((p) - 15) : \
                                      (((p) >= 52)  && ((p) <= 58)) ? ((p) - 51) : \
                                      (((p) >= 77)  && ((p) <= 84)) ? ((p) - 77) : \
                                      ((p) == 85) ? 0 : 0)

  // Analog pin defs
  #define NUM_ANALOG_INPUTS           (16)
  #define analogInputToDigitalPin(p)  ((p < 16) ? (p) + 69 : -1)
  #define analogPinToChannel(p)       ((p) < NUM_ANALOG_INPUTS ? (p) : (p) >= 69 ? (p) - 69 : -1)
  #define PIN_A0   (69)
  #define PIN_A1   (70)
  #define PIN_A2   (71)
  #define PIN_A3   (72)
  #define PIN_A4   (73)
  #define PIN_A5   (74)
  #define PIN_A6   (75)
  #define PIN_A7   (76)
  #define PIN_A8   (77)
  #define PIN_A9   (78)
  #define PIN_A10  (79)
  #define PIN_A11  (80)
  #define PIN_A12  (81)
  #define PIN_A13  (82)
  #define PIN_A14  (83)
  #define PIN_A15  (84)
  static const uint8_t A0 = PIN_A0;
  static const uint8_t A1 = PIN_A1;
  static const uint8_t A2 = PIN_A2;
  static const uint8_t A3 = PIN_A3;
  static const uint8_t A4 = PIN_A4;
  static const uint8_t A5 = PIN_A5;
  static const uint8_t A6 = PIN_A6;
  static const uint8_t A7 = PIN_A7;
  static const uint8_t A8 = PIN_A8;
  static const uint8_t A9 = PIN_A9;
  static const uint8_t A10 = PIN_A10;
  static const uint8_t A11 = PIN_A11;
  static const uint8_t A12 = PIN_A12;
  static const uint8_t A13 = PIN_A13;
  static const uint8_t A14 = PIN_A14;
  static const uint8_t A15 = PIN_A15;

  // PIN macros
  #define PIN_PE0 0
  #define PIN_PE1 1
  #define PIN_PE2 2
  #define PIN_PE3 3
  #define PIN_PE4 4
  #define PIN_PE5 5
  #define PIN_PE6 6
  #define PIN_PE7 7
  #define PIN_PH0 8
  #define PIN_PH1 9
  #define PIN_PH2 10
  #define PIN_PH3 11
  #define PIN_PH4 12
  #define PIN_PH5 13
  #define PIN_PH6 14
  #define PIN_PB0 15
  #define PIN_PB1 16
  #define PIN_PB2 17
  #define PIN_PB3 18
  #define PIN_PB4 19
  #define PIN_PB5 20
  #define PIN_PB6 21
  #define PIN_PB7 22
  #define PIN_PH7 23
  #define PIN_PG3 24
  #define PIN_PG4 25
  #define PIN_PL0 26
  #define PIN_PL1 27
  #define PIN_PL2 28
  #define PIN_PL3 29
  #define PIN_PL4 30
  #define PIN_PL5 31
  #define PIN_PL6 32
  #define PIN_PL7 33
  #define PIN_PD0 34
  #define PIN_PD1 35
  #define PIN_PD2 36
  #define PIN_PD3 37
  #define PIN_PD4 38
  #define PIN_PD5 39
  #define PIN_PD6 40
  #define PIN_PD7 41
  #define PIN_PG0 42
  #define PIN_PG1 43
  #define PIN_PC0 44
  #define PIN_PC1 45
  #define PIN_PC2 46
  #define PIN_PC3 47
  #define PIN_PC4 48
  #define PIN_PC5 49
  #define PIN_PC6 50
  #define PIN_PC7 51
  #define PIN_PJ0 52
  #define PIN_PJ1 53
  #define PIN_PJ2 54
  #define PIN_PJ3 55
  #define PIN_PJ4 56
  #define PIN_PJ5 57
  #define PIN_PJ6 58
  #define PIN_PG2 59
  #define PIN_PA7 60
  #define PIN_PA6 61
  #define PIN_PA5 62
  #define PIN_PA4 63
  #define PIN_PA3 64
  #define PIN_PA2 65
  #define PIN_PA1 66
  #define PIN_PA0 67
  #define PIN_PJ7 68
  #define PIN_PF0 69
  #define PIN_PF1 70
  #define PIN_PF2 71
  #define PIN_PF3 72
  #define PIN_PF4 73
  #define PIN_PF5 74
  #define PIN_PF6 75
  #define PIN_PF7 76
  #define PIN_PK0 77
  #define PIN_PK1 78
  #define PIN_PK2 79
  #define PIN_PK3 80
  #define PIN_PK4 81
  #define PIN_PK5 82
  #define PIN_PK6 83
  #define PIN_PK7 84
  #define PIN_PG5 85

  #ifdef ARDUINO_MAIN
    const uint16_t PROGMEM port_to_mode_PGM[] = {
      NOT_A_PORT,
      (uint16_t) &DDRA,
      (uint16_t) &DDRB,
      (uint16_t) &DDRC,
      (uint16_t) &DDRD,
      (uint16_t) &DDRE,
      (uint16_t) &DDRF,
      (uint16_t) &DDRG,
      (uint16_t) &DDRH,
      NOT_A_PORT,
      (uint16_t) &DDRJ,
      (uint16_t) &DDRK,
      (uint16_t) &DDRL,
    };

    const uint16_t PROGMEM port_to_output_PGM[] = {
      NOT_A_PORT,
      (uint16_t) &PORTA,
      (uint16_t) &PORTB,
      (uint16_t) &PORTC,
      (uint16_t) &PORTD,
      (uint16_t) &PORTE,
      (uint16_t) &PORTF,
      (uint16_t) &PORTG,
      (uint16_t) &PORTH,
      NOT_A_PORT,
      (uint16_t) &PORTJ,
      (uint16_t) &PORTK,
      (uint16_t) &PORTL,
    };

    const uint16_t PROGMEM port_to_input_PGM[] = {
      NOT_A_PIN,
      (uint16_t) &PINA,
      (uint16_t) &PINB,
      (uint16_t) &PINC,
      (uint16_t) &PIND,
      (uint16_t) &PINE,
      (uint16_t) &PINF,
      (uint16_t) &PING,
      (uint16_t) &PINH,
      NOT_A_PIN,
      (uint16_t) &PINJ,
      (uint16_t) &PINK,
      (uint16_t) &PINL,
    };

    // Port list
    const uint8_t PROGMEM digital_pin_to_port_PGM[] = {
      PE, // PE 0 ** 0
      PE, // PE 1 ** 1
      PE, // PE 2 ** 2
      PE, // PE 3 ** 3
      PE, // PE 4 ** 4
      PE, // PE 5 ** 5
      PE, // PE 6 ** 6
      PE, // PE 7 ** 7
      PH, // PH 0 ** 8
      PH, // PH 1 ** 9
      PH, // PH 2 ** 10
      PH, // PH 3 ** 11
      PH, // PH 4 ** 12
      PH, // PH 5 ** 13
      PH, // PH 6 ** 14
      PB, // PB 0 ** 15
      PB, // PB 1 ** 16
      PB, // PB 2 ** 17
      PB, // PB 3 ** 18
      PB, // PB 4 ** 19
      PB, // PB 5 ** 20
      PB, // PB 6 ** 21
      PB, // PB 7 ** 22
      PH, // PH 7 ** 23
      PG, // PG 3 ** 24
      PG, // PG 4 ** 25
      PL, // PL 0 ** 26
      PL, // PL 1 ** 27
      PL, // PL 2 ** 28
      PL, // PL 3 ** 29
      PL, // PL 4 ** 30
      PL, // PL 5 ** 31
      PL, // PL 6 ** 32
      PL, // PL 7 ** 33
      PD, // PD 0 ** 34
      PD, // PD 1 ** 35
      PD, // PD 2 ** 36
      PD, // PD 3 ** 37
      PD, // PD 4 ** 38
      PD, // PD 5 ** 39
      PD, // PD 6 ** 40
      PD, // PD 7 ** 41
      PG, // PG 0 ** 42
      PG, // PG 1 ** 43
      PC, // PC 0 ** 44
      PC, // PC 1 ** 45
      PC, // PC 2 ** 46
      PC, // PC 3 ** 47
      PC, // PC 4 ** 48
      PC, // PC 5 ** 49
      PC, // PC 6 ** 50
      PC, // PC 7 ** 51
      PJ, // PJ 0 ** 52
      PJ, // PJ 1 ** 53
      PJ, // PJ 2 ** 54
      PJ, // PJ 3 ** 55
      PJ, // PJ 4 ** 56
      PJ, // PJ 5 ** 57
      PJ, // PJ 6 ** 58
      PG, // PG 2 ** 59
      PA, // PA 7 ** 60
      PA, // PA 6 ** 61
      PA, // PA 5 ** 62
      PA, // PA 4 ** 63
      PA, // PA 3 ** 64
      PA, // PA 2 ** 65
      PA, // PA 1 ** 66
      PA, // PA 0 ** 67
      PJ, // PJ 7 ** 68
      PF, // PF 0 ** 69
      PF, // PF 1 ** 70
      PF, // PF 2 ** 71
      PF, // PF 3 ** 72
      PF, // PF 4 ** 73
      PF, // PF 5 ** 74
      PF, // PF 6 ** 75
      PF, // PF 7 ** 76
      PK, // PK 0 ** 77
      PK, // PK 1 ** 78
      PK, // PK 2 ** 79
      PK, // PK 3 ** 80
      PK, // PK 4 ** 81
      PK, // PK 5 ** 82
      PK, // PK 6 ** 83
      PK, // PK 7 ** 84
      PG, // PG 5 ** 85
    };

    // Pin in port
    const uint8_t PROGMEM digital_pin_to_bit_mask_PGM[] = {
      _BV(0), // PE 0 ** 0
      _BV(1), // PE 1 ** 1
      _BV(2), // PE 2 ** 2
      _BV(3), // PE 3 ** 3
      _BV(4), // PE 4 ** 4
      _BV(5), // PE 5 ** 5
      _BV(6), // PE 6 ** 6
      _BV(7), // PE 7 ** 7
      _BV(0), // PH 0 ** 8
      _BV(1), // PH 1 ** 9
      _BV(2), // PH 2 ** 10
      _BV(3), // PH 3 ** 11
      _BV(4), // PH 4 ** 12
      _BV(5), // PH 5 ** 13
      _BV(6), // PH 6 ** 14
      _BV(0), // PB 0 ** 15
      _BV(1), // PB 1 ** 16
      _BV(2), // PB 2 ** 17
      _BV(3), // PB 3 ** 18
      _BV(4), // PB 4 ** 19
      _BV(5), // PB 5 ** 20
      _BV(6), // PB 6 ** 21
      _BV(7), // PB 7 ** 22
      _BV(7), // PH 7 ** 23
      _BV(3), // PG 3 ** 24
      _BV(4), // PG 4 ** 25
      _BV(0), // PL 0 ** 26
      _BV(1), // PL 1 ** 27
      _BV(2), // PL 2 ** 28
      _BV(3), // PL 3 ** 29
      _BV(4), // PL 4 ** 30
      _BV(5), // PL 5 ** 31
      _BV(6), // PL 6 ** 32
      _BV(7), // PL 7 ** 33
      _BV(0), // PD 0 ** 34
      _BV(1), // PD 1 ** 35
      _BV(2), // PD 2 ** 36
      _BV(3), // PD 3 ** 37
      _BV(4), // PD 4 ** 38
      _BV(5), // PD 5 ** 39
      _BV(6), // PD 6 ** 40
      _BV(7), // PD 7 ** 41
      _BV(0), // PG 0 ** 42
      _BV(1), // PG 1 ** 43
      _BV(0), // PC 0 ** 44
      _BV(1), // PC 1 ** 45
      _BV(2), // PC 2 ** 46
      _BV(3), // PC 3 ** 47
      _BV(4), // PC 4 ** 48
      _BV(5), // PC 5 ** 49
      _BV(6), // PC 6 ** 50
      _BV(7), // PC 7 ** 51
      _BV(0), // PJ 0 ** 52
      _BV(1), // PJ 1 ** 53
      _BV(2), // PJ 2 ** 54
      _BV(3), // PJ 3 ** 55
      _BV(4), // PJ 4 ** 56
      _BV(5), // PJ 5 ** 57
      _BV(6), // PJ 6 ** 58
      _BV(2), // PG 2 ** 59
      _BV(7), // PA 7 ** 60
      _BV(6), // PA 6 ** 61
      _BV(5), // PA 5 ** 62
      _BV(4), // PA 4 ** 63
      _BV(3), // PA 3 ** 64
      _BV(2), // PA 2 ** 65
      _BV(1), // PA 1 ** 66
      _BV(0), // PA 0 ** 67
      _BV(7), // PJ 7 ** 68
      _BV(0), // PF 0 ** 69
      _BV(1), // PF 1 ** 70
      _BV(2), // PF 2 ** 71
      _BV(3), // PF 3 ** 72
      _BV(4), // PF 4 ** 73
      _BV(5), // PF 5 ** 74
      _BV(6), // PF 6 ** 75
      _BV(7), // PF 7 ** 76
      _BV(0), // PK 0 ** 77
      _BV(1), // PK 1 ** 78
      _BV(2), // PK 2 ** 79
      _BV(3), // PK 3 ** 80
      _BV(4), // PK 4 ** 81
      _BV(5), // PK 5 ** 82
      _BV(6), // PK 6 ** 83
      _BV(7), // PK 7 ** 84
      _BV(5), // PG 5 ** 85
    };

