black-box-iot/proMega/variants/100-pin-avr/pins_arduino.h
    // Timers
    const uint8_t PROGMEM digital_pin_to_timer_PGM[] = {
      NOT_ON_TIMER, // PE 0 ** 0
      NOT_ON_TIMER, // PE 1 ** 1
      NOT_ON_TIMER, // PE 2 ** 2
      NOT_ON_TIMER, // PE 3 ** 3
      NOT_ON_TIMER, // PE 4 ** 4
      NOT_ON_TIMER, // PE 5 ** 5
      NOT_ON_TIMER, // PE 6 ** 6
      NOT_ON_TIMER, // PE 7 ** 7
      NOT_ON_TIMER, // PJ 0 ** 8
      NOT_ON_TIMER, // PJ 1 ** 9
      NOT_ON_TIMER, // PB 0 ** 10
      NOT_ON_TIMER, // PB 1 ** 11
      NOT_ON_TIMER, // PB 2 ** 12
      NOT_ON_TIMER, // PB 3 ** 13
      TIMER0A,      // PB 4 ** 14
      TIMER1A,      // PB 5 ** 15
      TIMER1B,      // PB 6 ** 16
      TIMER2A,      // PB 7 ** 17
      NOT_ON_TIMER, // PG 3 ** 18
      NOT_ON_TIMER, // PG 4 ** 19
      NOT_ON_TIMER, // PJ 2 ** 20
      NOT_ON_TIMER, // PJ 3 ** 21
      NOT_ON_TIMER, // PJ 4 ** 22
      NOT_ON_TIMER, // PJ 5 ** 23
      NOT_ON_TIMER, // PJ 6 ** 24
      NOT_ON_TIMER, // PD 0 ** 25
      NOT_ON_TIMER, // PD 1 ** 26
      NOT_ON_TIMER, // PD 2 ** 27
      NOT_ON_TIMER, // PD 3 ** 28
      NOT_ON_TIMER, // PD 4 ** 29
      NOT_ON_TIMER, // PD 5 ** 30
      NOT_ON_TIMER, // PD 6 ** 31
      NOT_ON_TIMER, // PD 7 ** 32
      NOT_ON_TIMER, // PG 0 ** 33
      NOT_ON_TIMER, // PG 1 ** 34
      NOT_ON_TIMER, // PC 0 ** 35
      NOT_ON_TIMER, // PC 1 ** 36
      NOT_ON_TIMER, // PC 2 ** 37
      NOT_ON_TIMER, // PC 3 ** 38
      NOT_ON_TIMER, // PC 4 ** 39
      NOT_ON_TIMER, // PC 5 ** 40
      NOT_ON_TIMER, // PH 0 ** 41
      NOT_ON_TIMER, // PH 1 ** 42
      NOT_ON_TIMER, // PH 2 ** 43
      NOT_ON_TIMER, // PH 3 ** 44
      NOT_ON_TIMER, // PC 6 ** 45
      NOT_ON_TIMER, // PC 7 ** 46
      NOT_ON_TIMER, // PG 2 ** 47
      NOT_ON_TIMER, // PA 7 ** 48
      NOT_ON_TIMER, // PA 6 ** 49
      NOT_ON_TIMER, // PA 5 ** 50
      NOT_ON_TIMER, // PA 4 ** 51
      NOT_ON_TIMER, // PA 3 ** 52
      NOT_ON_TIMER, // PA 2 ** 53
      NOT_ON_TIMER, // PA 1 ** 54
      NOT_ON_TIMER, // PA 0 ** 55
      NOT_ON_TIMER, // PH 4 ** 56
      NOT_ON_TIMER, // PH 5 ** 57
      NOT_ON_TIMER, // PH 6 ** 58
      NOT_ON_TIMER, // PH 7 ** 59
      NOT_ON_TIMER, // PF 0 ** 60
      NOT_ON_TIMER, // PF 1 ** 61
      NOT_ON_TIMER, // PF 2 ** 62
      NOT_ON_TIMER, // PF 3 ** 63
      NOT_ON_TIMER, // PF 4 ** 64
      NOT_ON_TIMER, // PF 5 ** 65
      NOT_ON_TIMER, // PF 6 ** 66
      NOT_ON_TIMER, // PF 7 ** 67
    };
  
  #endif //ARDUINO_MAIN

#endif // ATmega3250, ATmega3290, ATmega6450, ATmega6490

#endif // Pins_Arduino_h
